Revit 2026 API

# FailureMessageAccessor Properties

---

The FailureMessageAccessor type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

FailureMessageAccessor Class

Autodesk.Revit.DB Namespace